In [2]:
import pandas as pd
# Create Dataframe from Series
# Each Series will be stored as a row in Dataframe
car1 = pd.Series({'Make': 'Ferrari', 'Model': '458-Italia', 'Year': '2008', 'Cost': 350000})
car2 = pd.Series({'Make': 'Jeep', 'Model': 'Grand Cherokee', 'Year': '2015','Cost': 30000})
car3 = pd.Series({'Make': 'Dodge', 'Model': 'Challenger', 'Year': '2016', 'Cost': 18000})

# head() for dataframe prints out table, which is super nice
garage = pd.DataFrame([car1, car2, car3], index = ['Horse', 'Cherokee', 'Muscle'])
garage.head()

             Make           Model  Year    Cost
Horse     Ferrari      458-Italia  2008  350000
Cherokee     Jeep  Grand Cherokee  2015   30000
Muscle      Dodge      Challenger  2016   18000

In [3]:
# loc[] prints out designated row
garage.loc['Cherokee']

Make               Jeep
Model    Grand Cherokee
Year               2015
Cost              30000
Name: Cherokee, dtype: object

In [5]:
type(garage.loc['Horse'])

pandas.core.series.Series

In [6]:
# When a Dataframe has repeated indexes, loc[] will display all rows with that index
garage = pd.DataFrame([car1, car2, car3], index = ['Horse', 'Horse', 'Muscle'])
garage.loc['Horse']

          Make           Model  Year    Cost
Horse  Ferrari      458-Italia  2008  350000
Horse     Jeep  Grand Cherokee  2015   30000

In [7]:
# Or you can access elements in the table using loc[row, column]
garage = pd.DataFrame([car1, car2, car3], index = ['Sports Car', 'SUV', 'Coupe'])
garage.loc['Sports Car','Year']

'2008'

In [14]:
# df.T transpose the table 
garage.T.head()

       Sports Car             SUV       Coupe
Make      Ferrari            Jeep       Dodge
Model  458-Italia  Grand Cherokee  Challenger
Year         2008            2015        2016
Cost       350000           30000       18000

In [13]:
garage.T.loc['Model']

Sports Car        458-Italia
SUV           Grand Cherokee
Coupe             Challenger
Name: Model, dtype: object

In [16]:
garage.loc[['SUV','Coupe'], ['Year','Cost']]

       Year   Cost
SUV    2015  30000
Coupe  2016  18000

In [17]:
garage.loc[:,['Year','Cost']]

            Year    Cost
Sports Car  2008  350000
SUV         2015   30000
Coupe       2016   18000

In [18]:
reduced_garage = garage.drop('SUV')

In [19]:
reduced_garage

               Make       Model  Year    Cost
Sports Car  Ferrari  458-Italia  2008  350000
Coupe         Dodge  Challenger  2016   18000